programming/python/python_function.org
#+SETUPFILE: ../../styles/readtheorg.setup
#+TITLE: Python Function

* 内置

| *字符串*   | =chr()=      | 输入 ASCII 值，返回字符         |
|            | =ord()=      | 输入字符，返回 ASCII 值         |
|            | =repr()=     | 将对象转换为其字符串格式        |
|------------+--------------+---------------------------------|
| *序列*     | =len()=      |                                 |
|            | =range()=    | 生成连续值序列                  |
|            | =min()=      | 字面值最小的元素                |
|            | =max()=      | 字面值最大的元素                |
|------------+--------------+---------------------------------|
| *序列迭代* | =sum()=      |                                 |
|            | =map()=      | 对每个元素应用函数              |
|            | =any()=      | 任何元素是 =True= 则返回 =True= |
|------------+--------------+---------------------------------|
| *序列排序* | =sorted()=   | 排序                            |
|            | =reversed()= | 倒序                            |
|------------+--------------+---------------------------------|
| *文件*     | =file()=     |                                 |
|            | =open()=     |                                 |

** =any()=

#+BEGIN_SRC python
any ( iterable )
#+END_SRC

#+CAPTION: 检查字符串中是否存在数字字符
#+BEGIN_SRC python
hasdigit = any(map(str.isdigit, string))
#+END_SRC

** =file()=

#+BEGIN_SRC python
file(
    name
[,  mode
[,  buffering
]])
#+END_SRC

=file= 类型的构建方法，返回 =file= 类型实例。打开文件时建议使用 =open()= 。

** =len()=

#+BEGIN_SRC python
len ( seq )
#+END_SRC

** =map()=

#+BEGIN_SRC python
map (
    function
,   iterable
,   ...
)
#+END_SRC

#+CAPTION: 示例
#+BEGIN_SRC python
s = list(map(abs, [-1, 0, 1]))
n, m = map(int, raw_input().split())
#+END_SRC

** =open()=

#+BEGIN_SRC python
open(
    name
[,  mode
[,  buffering
]])
#+END_SRC

以指定权限打开文件，返回 =file= 类型示例。

#+CAPTION: =mode=
| =r=  | 读默认值   |
|------+------------|
| =w=  | 覆盖写    |
|------+------------|
| =a=  | 追加写    |
|------+------------|
| =a+= | 读写       |
|------+------------|
| =B=  | 二进制文件 |

#+BEGIN_SRC python
fname = raw_input('Open file: ')
fhandle = open(filename)
print fhandle.read()
fhanlde.close()
#+END_SRC

** =range()=

#+BEGIN_SRC python
range(stop) # 从 0 开始到 stop 为止，不包括 stop

range(      # 指定开始和结束
    start
,   stop    # 不包括右边界
[,  step
])
#+END_SRC

#+CAPTION: 示例
#+BEGIN_SRC python
range(10)         # [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
range(0, 30, 5)   # [0, 5, 10, 15, 20, 25]
range(0, -10, -1) # [0, -1, -2, -3, -4, -5, -6, -7, -8, -9]
range(0)          # []
#+END_SRC

** =sum()=

#+BEGIN_SRC python
sum (
    iterable,
[,  start
])
#+END_SRC

