programming/python/python_function.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-02-23 Sat 15:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Python Function</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Victor Chen" />
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/font.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/htmlize.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Python Function</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1b79ee6">1 内置</a>
<ul>
<li><a href="#orgb9d7740">1.1 <code>any()</code></a></li>
<li><a href="#org4b5048a">1.2 <code>file()</code></a></li>
<li><a href="#orgd27ec91">1.3 <code>len()</code></a></li>
<li><a href="#orgb8489b9">1.4 <code>map()</code></a></li>
<li><a href="#org4f6bc98">1.5 <code>open()</code></a></li>
<li><a href="#org4772e6e">1.6 <code>range()</code></a></li>
<li><a href="#org378048b">1.7 <code>sum()</code></a></li>
<li><a href="#org4b93305">1.8 <code>reversed()</code></a></li>
<li><a href="#orgfb8c66f">1.9 <code>sorted()</code></a></li>
</ul>
</li>
<li><a href="#org38e9bbd">2 输出</a>
<ul>
<li><a href="#orgd5beb17">2.1 格式化输出</a>
<ul>
<li><a href="#org4c01ac9">2.1.1 格式占位符</a></li>
<li><a href="#org1e9a916">2.1.2 示例</a></li>
</ul>
</li>
<li><a href="#org5c9366f">2.2 <code>eval()</code></a></li>
<li><a href="#orgb6392aa">2.3 <code>print</code></a></li>
<li><a href="#orga5fa994">2.4 <code>print()</code></a></li>
<li><a href="#orgafe7703">2.5 <code>repr()</code></a></li>
</ul>
</li>
<li><a href="#org013203e">3 输入</a>
<ul>
<li><a href="#orgec370cb">3.1 <code>input()</code></a></li>
<li><a href="#org0ef12b5">3.2 <code>raw_input()</code></a></li>
</ul>
</li>
<li><a href="#orgc0e2516">4 类型</a>
<ul>
<li><a href="#org48828cc">4.1 <code>complex()</code></a></li>
<li><a href="#org609a311">4.2 <code>dict</code></a></li>
<li><a href="#org22c50fa">4.3 <code>float()</code></a></li>
<li><a href="#org440ed50">4.4 <code>int()</code></a></li>
<li><a href="#org23fbc32">4.5 <code>isinstance()</code></a></li>
<li><a href="#org2835ef7">4.6 <code>list()</code></a></li>
<li><a href="#org433debc">4.7 <code>set()</code></a></li>
<li><a href="#org3ee07a0">4.8 <code>str()</code></a></li>
<li><a href="#orge58e401">4.9 <code>tuple()</code></a></li>
<li><a href="#org436da61">4.10 <code>type()</code></a></li>
</ul>
</li>
<li><a href="#orgbe31cae">5 数字</a>
<ul>
<li><a href="#org19c68ba">5.1 <code>bin()</code></a></li>
<li><a href="#org64e87bf">5.2 <code>round()</code></a></li>
</ul>
</li>
<li><a href="#orgcb63ada">6 字符串</a>
<ul>
<li><a href="#org50da2e1">6.1 <code>str.count()</code></a></li>
<li><a href="#org2c1e1dd">6.2 <code>str.find</code></a></li>
<li><a href="#orgf7c6ace">6.3 <code>str.format()</code></a></li>
<li><a href="#orgee537a6">6.4 <code>str.join()</code></a></li>
<li><a href="#orga62afa9">6.5 <code>str.replace()</code></a></li>
<li><a href="#org36b882c">6.6 <code>str.split()</code></a></li>
<li><a href="#org83c72be">6.7 <code>str.splitlines()</code></a></li>
<li><a href="#org50723be">6.8 <code>str.translate()</code></a></li>
</ul>
</li>
<li><a href="#org7daeac4">7 列表</a>
<ul>
<li><a href="#org558814d">7.1 <code>list.sort()</code></a></li>
<li><a href="#orgcbf9eff">7.2 <code>list.remove()</code></a></li>
</ul>
</li>
<li><a href="#orgc1f8907">8 字典</a>
<ul>
<li><a href="#org12c8eb2">8.1 <code>zip()</code></a></li>
<li><a href="#orgd507a8d">8.2 <code>dict.fromkeys()</code></a></li>
<li><a href="#org41d39b6">8.3 <code>dict.get()</code></a></li>
</ul>
</li>
<li><a href="#org196a8c3">9 集合</a>
<ul>
<li><a href="#orga854e4e">9.1 <code>set.add()</code></a></li>
<li><a href="#org3ae5e88">9.2 <code>set.update()</code></a></li>
</ul>
</li>
<li><a href="#org5dbc622">10 文件</a>
<ul>
<li><a href="#org34844c0">10.1 <code>file.read()</code></a></li>
<li><a href="#orgc11dd85">10.2 <code>file.seek()</code></a></li>
</ul>
</li>
<li><a href="#org8aae713">11 模块</a>
<ul>
<li><a href="#orgef60282">11.1 <code>dir()</code></a></li>
</ul>
</li>
<li><a href="#org5652cf1">12 特殊</a>
<ul>
<li><a href="#org4e7bd00">12.1 <code>__contains__()</code></a></li>
<li><a href="#orgacc56f0">12.2 <code>__getitem__()</code></a></li>
<li><a href="#orgbe477ba">12.3 <code>__init__()</code></a></li>
<li><a href="#org2ffe64d">12.4 <code>__len__()</code></a></li>
</ul>
</li>
<li><a href="#orga9adf49">13 其他</a>
<ul>
<li><a href="#org75f1688">13.1 <code>help()</code></a></li>
</ul>
</li>
<li><a href="#org4e02ec4">14 链接</a></li>
</ul>
</div>
</div>

<div id="outline-container-org1b79ee6" class="outline-2">
<h2 id="org1b79ee6"><span class="section-number-2">1</span> 内置</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>字符串</b></th>
<th scope="col" class="org-left"><code>chr()</code></th>
<th scope="col" class="org-left">输入 ASCII 值，返回字符</th>
</tr>

<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left"><code>ord()</code></th>
<th scope="col" class="org-left">输入字符，返回 ASCII 值</th>
</tr>

<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left"><code>repr()</code></th>
<th scope="col" class="org-left">将对象转换为其字符串格式</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>序列</b></td>
<td class="org-left"><code>len()</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>range()</code></td>
<td class="org-left">生成连续值序列</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>min()</code></td>
<td class="org-left">字面值最小的元素</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>max()</code></td>
<td class="org-left">字面值最大的元素</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>序列迭代</b></td>
<td class="org-left"><code>sum()</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>map()</code></td>
<td class="org-left">对每个元素应用函数</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>any()</code></td>
<td class="org-left">任何元素是 <code>True</code> 则返回 <code>True</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>序列排序</b></td>
<td class="org-left"><code>sorted()</code></td>
<td class="org-left">排序</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>reversed()</code></td>
<td class="org-left">倒序</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>文件</b></td>
<td class="org-left"><code>file()</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>open()</code></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-orgb9d7740" class="outline-3">
<h3 id="orgb9d7740"><span class="section-number-3">1.1</span> <code>any()</code></h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-python"><span class="org-builtin">any</span> ( iterable )
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>检查字符串中是否存在数字字符</label><pre class="src src-python"><span class="org-variable-name">hasdigit</span> = <span class="org-builtin">any</span>(<span class="org-builtin">map</span>(<span class="org-builtin">str</span>.isdigit, string))
</pre>
</div>
</div>
</div>

<div id="outline-container-org4b5048a" class="outline-3">
<h3 id="org4b5048a"><span class="section-number-3">1.2</span> <code>file()</code></h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-python"><span class="org-builtin">file</span>(
        name
[,  mode
[,  buffering
]])
</pre>
</div>

<p>
<code>file</code> 类型的构建方法，返回 <code>file</code> 类型实例。打开文件时建议使用 <code>open()</code> 。
</p>
</div>
</div>

<div id="outline-container-orgd27ec91" class="outline-3">
<h3 id="orgd27ec91"><span class="section-number-3">1.3</span> <code>len()</code></h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-python"><span class="org-builtin">len</span> ( seq )
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb8489b9" class="outline-3">
<h3 id="orgb8489b9"><span class="section-number-3">1.4</span> <code>map()</code></h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-python"><span class="org-builtin">map</span> (
        function
,   iterable
,   ...
)
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>示例</label><pre class="src src-python"><span class="org-variable-name">s</span> = <span class="org-builtin">list</span>(<span class="org-builtin">map</span>(<span class="org-builtin">abs</span>, [-1, 0, 1]))
<span class="org-variable-name">n</span>, <span class="org-variable-name">m</span> = <span class="org-builtin">map</span>(<span class="org-builtin">int</span>, <span class="org-builtin">raw_input</span>().split())
</pre>
</div>
</div>
</div>

<div id="outline-container-org4f6bc98" class="outline-3">
<h3 id="org4f6bc98"><span class="section-number-3">1.5</span> <code>open()</code></h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">
<pre class="src src-python"><span class="org-builtin">open</span>(
        name
[,  mode
[,  buffering
]])
</pre>
</div>

<p>
以指定权限打开文件，返回 <code>file</code> 类型示例。
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> <code>mode</code></caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><code>r</code></th>
<th scope="col" class="org-left">读默认值</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>w</code></td>
<td class="org-left">覆盖写</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>a</code></td>
<td class="org-left">追加写</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>a+</code></td>
<td class="org-left">读写</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>B</code></td>
<td class="org-left">二进制文件</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-python"><span class="org-variable-name">fname</span> = <span class="org-builtin">raw_input</span>(<span class="org-string">'Open file: '</span>)
<span class="org-variable-name">fhandle</span> = <span class="org-builtin">open</span>(filename)
<span class="org-keyword">print</span> fhandle.read()
fhanlde.close()
</pre>
</div>
</div>
</div>

<div id="outline-container-org4772e6e" class="outline-3">
<h3 id="org4772e6e"><span class="section-number-3">1.6</span> <code>range()</code></h3>
<div class="outline-text-3" id="text-1-6">
<div class="org-src-container">
<pre class="src src-python"><span class="org-builtin">range</span>(stop) <span class="org-comment-delimiter"># </span><span class="org-comment">&#20174; 0 &#24320;&#22987;&#21040; stop &#20026;&#27490;&#65292;&#19981;&#21253;&#25324; stop</span>

<span class="org-builtin">range</span>(      <span class="org-comment-delimiter"># </span><span class="org-comment">&#25351;&#23450;&#24320;&#22987;&#21644;&#32467;&#26463;</span>
        start
,   stop    <span class="org-comment-delimiter"># </span><span class="org-comment">&#19981;&#21253;&#25324;&#21491;&#36793;&#30028;</span>
[,  step
])
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>示例</label><pre class="src src-python"><span class="org-builtin">range</span>(10)         <span class="org-comment-delimiter"># </span><span class="org-comment">[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]</span>
<span class="org-builtin">range</span>(0, 30, 5)   <span class="org-comment-delimiter"># </span><span class="org-comment">[0, 5, 10, 15, 20, 25]</span>
<span class="org-builtin">range</span>(0, -10, -1) <span class="org-comment-delimiter"># </span><span class="org-comment">[0, -1, -2, -3, -4, -5, -6, -7, -8, -9]</span>
<span class="org-builtin">range</span>(0)          <span class="org-comment-delimiter"># </span><span class="org-comment">[]</span>
</pre>
</div>
</div>
</div>
