programming/python/python_function.org
* 特殊

#+ATTR_HTML: :class no-border
| *Special methods* | - invoked by interpreter to perform basic object operations |
|                   | - always named in =__<method>__= format                     |
|                   | - also known as "dunder" methods                            |

Special methods is a way to leverage the Python data model, by perform standard operations in a unified manner on different objects.

|                         | *重载方法、运算符*   |
|-------------------------+----------------------|
| *Object creation*       |                      |
| *and destruction*       |                      |
|-------------------------+----------------------|
| [[__init__][=__init__()=]]            | =<name> = <Class>()= |
|-------------------------+----------------------|
| *String representation* |                      |
| *and formatting*        |                      |
|-------------------------+----------------------|
| *Collection*            |                      |
|-------------------------+----------------------|
| [[__len__][=__len__()=]]             | =len()=              |
|-------------------------+----------------------|
| [[__getitem__][=__getitem__()=]]         | =[]=                 |
|-------------------------+----------------------|
| [[__contains__][=__contains__()=]]        | =in=                 |
|-------------------------+----------------------|
| *Iteration*             |                      |
|-------------------------+----------------------|
| *Attribute access*      |                      |
|-------------------------+----------------------|
| *Operator overloading*  |                      |
|-------------------------+----------------------|
| *Method invocation*     |                      |

** =__contains__()=
<<__contains__>>

If a collection has no =__contains__()= method, the =in= operator does a sequential scan.

** =__getitem__()=
<<__getitem__>>

Because =__getitem__()= delegates to the =[]= operator, the object automatically supports slicing and iteration.

#+CAPTION: 示例
#+BEGIN_SRC python
class Foo:
    def __init__(self):
        self._elements = [n * n for n in range(1, 10)]

    def __getitem__(self, position):
        return self._elements[position]

foo = Foo()
foo[1]   # 4
foo[2:5] # [9, 16, 25]
for i in foo: # 1, 4, 9, ...
#+END_SRC

** =__init__()=
<<__init__>>

子类的 =__init__()= 中需要手动调用父类的 =__init__()= ，Python 不会自动调用。

** =__len__()=
<<__len__>>

#+CAPTION: 示例
#+BEGIN_SRC python
class Foo:
    def __init__(self):
        self._elements = [n * n for n in range(1, 10)]

    def __len__(self):
        return len(self._elements)

foo = Foo()
len(foo) # 9
#+END_SRC

* 其他

| =help()= | 返回对象、对象的方法的注释文档 |
|----------+--------------------------------|
|          |                                |

** =help()=

#+BEGIN_SRC python
help([object])
#+END_SRC

#+BEGIN_SRC python
help(list.remove)
#+END_SRC

* 链接

1. [[https://docs.python.org/2.7/library/functions.html][Built-in Functions (2.7.12)]]
