programming/python/python_function.html

<div id="outline-container-org5652cf1" class="outline-2">
<h2 id="org5652cf1"><span class="section-number-2">12</span> 特殊</h2>
<div class="outline-text-2" id="text-12">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" class="no-border">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>Special methods</b></td>
<td class="org-left">- invoked by interpreter to perform basic object operations</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">- always named in <code>__&lt;method&gt;__</code> format</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">- also known as "dunder" methods</td>
</tr>
</tbody>
</table>

<p>
Special methods is a way to leverage the Python data model, by perform standard operations in a unified manner on different objects.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left"><b>重载方法、运算符</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>Object creation</b></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><b>and destruction</b></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><a href="#org002846a"><code>__init__()</code></a></td>
<td class="org-left"><code>&lt;name&gt; = &lt;Class&gt;()</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>String representation</b></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><b>and formatting</b></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>Collection</b></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><a href="#org6cf7337"><code>__len__()</code></a></td>
<td class="org-left"><code>len()</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><a href="#org226d989"><code>__getitem__()</code></a></td>
<td class="org-left"><code>[]</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><a href="#orgd6b9b52"><code>__contains__()</code></a></td>
<td class="org-left"><code>in</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>Iteration</b></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>Attribute access</b></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>Operator overloading</b></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>Method invocation</b></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-org4e7bd00" class="outline-3">
<h3 id="org4e7bd00"><span class="section-number-3">12.1</span> <code>__contains__()</code></h3>
<div class="outline-text-3" id="text-12-1">
<p>
<a id="orgd6b9b52"></a>
</p>

<p>
If a collection has no <code>__contains__()</code> method, the <code>in</code> operator does a sequential scan.
</p>
</div>
</div>

<div id="outline-container-orgacc56f0" class="outline-3">
<h3 id="orgacc56f0"><span class="section-number-3">12.2</span> <code>__getitem__()</code></h3>
<div class="outline-text-3" id="text-12-2">
<p>
<a id="org226d989"></a>
</p>

<p>
Because <code>__getitem__()</code> delegates to the <code>[]</code> operator, the object automatically supports slicing and iteration.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 27: </span>示例</label><pre class="src src-python"><span class="org-keyword">class</span> <span class="org-type">Foo</span>:
        <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>):
                <span class="org-keyword">self</span>._elements = [n * n <span class="org-keyword">for</span> n <span class="org-keyword">in</span> <span class="org-builtin">range</span>(1, 10)]

        <span class="org-keyword">def</span> <span class="org-function-name">__getitem__</span>(<span class="org-keyword">self</span>, position):
                <span class="org-keyword">return</span> <span class="org-keyword">self</span>._elements[position]

<span class="org-variable-name">foo</span> = Foo()
foo[1]   <span class="org-comment-delimiter"># </span><span class="org-comment">4</span>
foo[2:5] <span class="org-comment-delimiter"># </span><span class="org-comment">[9, 16, 25]</span>
<span class="org-keyword">for</span> i <span class="org-keyword">in</span> foo: <span class="org-comment-delimiter"># </span><span class="org-comment">1, 4, 9, ...</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbe477ba" class="outline-3">
<h3 id="orgbe477ba"><span class="section-number-3">12.3</span> <code>__init__()</code></h3>
<div class="outline-text-3" id="text-12-3">
<p>
<a id="org002846a"></a>
</p>

<p>
子类的 <code>__init__()</code> 中需要手动调用父类的 <code>__init__()</code> ，Python 不会自动调用。
</p>
</div>
</div>

<div id="outline-container-org2ffe64d" class="outline-3">
<h3 id="org2ffe64d"><span class="section-number-3">12.4</span> <code>__len__()</code></h3>
<div class="outline-text-3" id="text-12-4">
<p>
<a id="org6cf7337"></a>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 28: </span>示例</label><pre class="src src-python"><span class="org-keyword">class</span> <span class="org-type">Foo</span>:
        <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>):
                <span class="org-keyword">self</span>._elements = [n * n <span class="org-keyword">for</span> n <span class="org-keyword">in</span> <span class="org-builtin">range</span>(1, 10)]

        <span class="org-keyword">def</span> <span class="org-function-name">__len__</span>(<span class="org-keyword">self</span>):
                <span class="org-keyword">return</span> <span class="org-builtin">len</span>(<span class="org-keyword">self</span>._elements)

<span class="org-variable-name">foo</span> = Foo()
<span class="org-builtin">len</span>(foo) <span class="org-comment-delimiter"># </span><span class="org-comment">9</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga9adf49" class="outline-2">
<h2 id="orga9adf49"><span class="section-number-2">13</span> 其他</h2>
<div class="outline-text-2" id="text-13">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><code>help()</code></th>
<th scope="col" class="org-left">返回对象、对象的方法的注释文档</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-org75f1688" class="outline-3">
<h3 id="org75f1688"><span class="section-number-3">13.1</span> <code>help()</code></h3>
<div class="outline-text-3" id="text-13-1">
<div class="org-src-container">
<pre class="src src-python"><span class="org-builtin">help</span>([<span class="org-builtin">object</span>])
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span class="org-builtin">help</span>(<span class="org-builtin">list</span>.remove)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4e02ec4" class="outline-2">
<h2 id="org4e02ec4"><span class="section-number-2">14</span> 链接</h2>
<div class="outline-text-2" id="text-14">
<ol class="org-ol">
<li><a href="https://docs.python.org/2.7/library/functions.html">Built-in Functions (2.7.12)</a></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Victor Chen</p>
<p class="date">Created: 2019-02-23 Sat 15:13</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
